// 教室データを管理する「辞書」のようなものです
// 教室データを管理する「辞書」のようなものです
const roomDatabase = {
    "101": {
        "name": "101教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 大, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "08:50",
                "end": "10:20",
                "title": "キャリアデザインB (井出野)"
            },
            {
                "day": 1,
                "start": "10:30",
                "end": "12:00",
                "title": "イノベーションマネジメント (佐藤(治))"
            },
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "マクロ経済学2 (下川)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "デジタル・マーケティング (新井)"
            },
            {
                "day": 1,
                "start": "16:20",
                "end": "17:50",
                "title": "応用マーケティング (新井)"
            },
            {
                "day": 2,
                "start": "08:50",
                "end": "10:20",
                "title": "応用マーケティング (新井)"
            },
            {
                "day": 2,
                "start": "10:30",
                "end": "12:00",
                "title": "マクロ経済学2 (野田)"
            },
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "経営組織 (川崎)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "応用原価計算 (岩澤)"
            },
            {
                "day": 3,
                "start": "10:30",
                "end": "12:00",
                "title": "ミクロ経済学2 (野田)"
            },
            {
                "day": 4,
                "start": "08:50",
                "end": "10:20",
                "title": "アセットプライシング2 (鈴木)"
            },
            {
                "day": 4,
                "start": "10:30",
                "end": "12:00",
                "title": "アセットプライシング2(演習) (鈴木)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "マーケティング概論2 (石川)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "金融リテラシーA (何・秦)"
            },
            {
                "day": 4,
                "start": "16:20",
                "end": "17:50",
                "title": "マーケティング・リサーチ (酒井)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "データサイエンスの基礎2 (安藤)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "情報処理概論 (小俣)"
            },
            {
                "day": 5,
                "start": "16:20",
                "end": "17:50",
                "title": "データ処理法 (小俣)"
            }
        ]
    },
    "201": {
        "name": "201教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L4-4) (三木)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L3-3) (三木)"
            },
            {
                "day": 2,
                "start": "16:20",
                "end": "17:50",
                "title": "外書講読 (伊藤)"
            },
            {
                "day": 3,
                "start": "16:20",
                "end": "17:50",
                "title": "ミクロ計量経済学 (山田)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "自然言語処理 (亀田)"
            },
            {
                "day": 5,
                "start": "10:30",
                "end": "12:00",
                "title": "機械学習 (安藤)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "情報と契約の経済学 (颯々野)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "ビッグデータ解析 (野口)"
            },
            {
                "day": 5,
                "start": "16:20",
                "end": "17:50",
                "title": "経済予測 (鄭)"
            }
        ]
    },
    "301": {
        "name": "301教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 大, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "08:50",
                "end": "10:20",
                "title": "グローバル経営学 (渡邊)"
            },
            {
                "day": 1,
                "start": "10:30",
                "end": "12:00",
                "title": "財務会計 (秦)"
            },
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "統計的機械学習 (谷本)"
            },
            {
                "day": 1,
                "start": "16:20",
                "end": "17:50",
                "title": "企業会計 (柳田)"
            },
            {
                "day": 2,
                "start": "08:50",
                "end": "10:20",
                "title": "計量経済学2 (照井)"
            },
            {
                "day": 2,
                "start": "10:30",
                "end": "12:00",
                "title": "計量経済学2(演習) (照井)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "特殊講義2 (高橋)"
            },
            {
                "day": 3,
                "start": "10:30",
                "end": "12:00",
                "title": "データサイエンスの基礎2 (安藤)"
            },
            {
                "day": 3,
                "start": "13:00",
                "end": "14:30",
                "title": "統計的機械学習 (谷本)"
            },
            {
                "day": 3,
                "start": "14:40",
                "end": "16:10",
                "title": "確率・統計および演習1 (照井)"
            },
            {
                "day": 3,
                "start": "16:20",
                "end": "17:50",
                "title": "確率・統計および演習2 (照井)"
            },
            {
                "day": 4,
                "start": "16:20",
                "end": "17:50",
                "title": "マーケティング・サイエンス (酒井)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "実証会計・ファイナンス (何)"
            }
        ]
    },
    "302": {
        "name": "302教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 大, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "産業組織論 (梅澤)"
            },
            {
                "day": 2,
                "start": "08:50",
                "end": "10:20",
                "title": "ゲーム理論2 (中田)"
            },
            {
                "day": 2,
                "start": "10:30",
                "end": "12:00",
                "title": "ゲーム理論2(演習) (中田)"
            },
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "ゲーム理論2 (1組) (梅澤)"
            },
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "ゲーム理論2 (2組) (中田)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "ゲーム理論2演習 (1組) (梅澤)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "ゲーム理論2演習 (2組) (中田)"
            },
            {
                "day": 3,
                "start": "13:00",
                "end": "14:30",
                "title": "産業組織論 (梅澤)"
            },
            {
                "day": 3,
                "start": "14:40",
                "end": "16:10",
                "title": "応用統計学 (野澤)"
            },
            {
                "day": 3,
                "start": "16:20",
                "end": "17:50",
                "title": "応用統計学(演習) (野澤)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "時系列データ分析 (高橋慎)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "プログラミング論2 (1組) (野口)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10", "title": "プログラミング論2 (2組) (野口)"
            }
        ]
    },
    "303": {
        "name": "303教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 大, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "08:50",
                "end": "10:20",
                "title": "データ分析入門 (柿原)"
            },
            {
                "day": 1,
                "start": "10:30",
                "end": "12:00",
                "title": "データ分析入門 (柿原)"
            },
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "応用財務会計 (柳田)"
            },
            {
                "day": 3,
                "start": "14:40",
                "end": "16:10",
                "title": "線形代数および演習2 (颯々野)"
            },
            {
                "day": 3,
                "start": "16:20",
                "end": "17:50",
                "title": "線形代数および演習2 (颯々野)"
            },
            {
                "day": 4,
                "start": "08:50",
                "end": "10:20",
                "title": "応用統計学 (野澤)"
            },
            {
                "day": 4,
                "start": "10:30",
                "end": "12:00",
                "title": "応用統計学(演習) (野澤)"
            },
            {
                "day": 5,
                "start": "10:30",
                "end": "12:00",
                "title": "薄記論 (島崎)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "企業ファイナンス (田村)"
            }
        ]
    },
    "304": {
        "name": "304教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L3-2) (カシム)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "PBL (新井)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L3-2) (佐々木)"
            }
        ]
    },
    "305": {
        "name": "305教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L2-4) (ランゴット)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L2-1) (大石)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (ロウレス) (ロウレス)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Oral Comm 2 (ロウレス) (ロウレス)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Practical English 2 (ロウレス) (ロウレス)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L3-3) (B.スミス)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L1-1) (渡丸)"
            }
        ]
    },
    "307": {
        "name": "303教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": []
    },
    "308": {
        "name": "308教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": []
    },
    "309": {
        "name": "309教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": []
    },
    "401": {
        "name": "401教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "10:30",
                "end": "12:00",
                "title": "Design Thinking (Advanced) (高島)"
            },
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "Design Thinking (Advanced) (高島)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "税務会計 (柳田)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (宮嶋) (宮嶋)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Practical English 2 (宮嶋) (宮嶋)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Oral Comm 2 (宮嶋) (宮嶋)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L1-2) (宮嶋)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L1-3) (宮嶋)"
            }
        ]
    },
    "402": {
        "name": "402教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 大, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "Enterprise Architecture (増田)"
            },
            {
                "day": 1,
                "start": "16:20",
                "end": "17:50",
                "title": "Enterprise Architecture (増田)"
            },
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "ブランド論 (新井)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "ビジネス法2 (高岸)"
            },
            {
                "day": 3,
                "start": "14:40",
                "end": "16:10",
                "title": "アセットプライシング2 (鈴木)"
            },
            {
                "day": 3,
                "start": "16:20",
                "end": "17:50",
                "title": "アセットプライシング2(演習) (鈴木)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "財務諸表論 (島崎)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "オペレーションズリサーチ (施)"
            }
        ]
    },
    "403": {
        "name": "403教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 中, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "10:30",
                "end": "12:00",
                "title": "生産マネジメント (伊藤)"
            },
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (再履修) (コーペット)"
            }
        ]
    },
    "404": {
        "name": "404教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 小, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L2-2) (ブガエワ)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "イノベーション・チーム・ラボ (渡邉・佐藤他)"
            },
            {
                "day": 3,
                "start": "14:40",
                "end": "16:10",
                "title": "イノベーション・チーム・ラボ (渡邉・佐藤他)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Practical English 2 (B.スミス) (B.スミス)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (再履修) (渡丸)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L2-2) (大石)"
            }
        ]
    },
    "405": {
        "name": "405教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": []
    },
    "406": {
        "name": "406教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": []
    },
    "501": {
        "name": "501教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L3-1) (ランゴット)"
            },
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "計量経済学2 (2組) (野田)"
            },
            {
                "day": 2,
                "start": "14:40",
                "end": "16:10",
                "title": "計量経済学2演習 (2組) (野田)"
            },
            {
                "day": 4,
                "start": "08:50",
                "end": "10:20",
                "title": "応用マーケティング2 (朝日)"
            },
            {
                "day": 4,
                "start": "10:30",
                "end": "12:00",
                "title": "応用マーケティング2 (朝日)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "証券投資論 (鈴木)"
            }
        ]
    },
    "502": {
        "name": "502教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "産業組織論 (梅澤)"
            },
            {
                "day": 2,
                "start": "13:00", "end": "14:30",
                "title": "計量経済学2 (1組) (照井)"
            },
            {
                "day": 2,
                "start": "14:40", "end": "16:10", "title": "計量経済学2演習 (1組) (照井)"
            },
            {
                "day": 4,
                "start": "08:50",
                "end": "10:20",
                "title": "コーポレート・ファイナンス (吉田)"
            }
        ]
    },
    "503": {
        "name": "503教室",
        "equipment": "🔌電源: あり, 👥教室の広さ: 中, 🪑机: 固定式",
        "reviews": [],
        "schedule": [
            {
                "day": 2,
                "start": "13:00",
                "end": "14:30",
                "title": "応用ファイナンス2 (山田)"
            },
            {
                "day": 3,
                "start": "10:30",
                "end": "12:00",
                "title": "組織の経済学 (石原)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (アーネル) (アーネル)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L4-4) (ブガエワ)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L4-2) (ブガエワ)"
            }
        ]
    },
    "505": {
        "name": "505教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L1-1) (センダ)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L2-3) (センダ)"
            },
            {
                "day": 2,
                "start": "10:30",
                "end": "12:00",
                "title": "PBL (椿)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (大石) (大石)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Practical English 2 (大石) (大石)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Practical English 2 (大石) (大石)"
            }
        ]
    },
    "506": {
        "name": "506教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L4-2) (大津留)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L4-1) (大津留)"
            },
            {
                "day": 1,
                "start": "16:20",
                "end": "17:50",
                "title": "R&W 2 (再履修) (大津留)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Practical English 2 (トゥクラル) (トゥクラル)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Practical English 2 (トゥクラル) (トゥクラル)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L4-1) (キンケイド)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L4-3) (キンケイド)"
            }
        ]
    },
    "507": {
        "name": "507教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L3-4) (渡丸)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L2-1) (ダニエルズ)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L2-4) (ダニエルズ)"
            }
        ]
    },
    "508": {
        "name": "508教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 小, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L1-3) (立野)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (コーペット) (コーペット)"
            },
            {
                "day": 4,
                "start": "14:40",
                "end": "16:10",
                "title": "Oral Comm 2 (コーペット) (コーペット)"
            },
            {
                "day": 5,
                "start": "13:00",
                "end": "14:30",
                "title": "R&W 4 (L3-1) (ロウレス)"
            }
        ]
    },
    "509": {
        "name": "509教室",
        "equipment": "🔌電源: なし, 👥教室の広さ: 中, 🪑机: 可動式",
        "reviews": [],
        "schedule": [
            {
                "day": 1,
                "start": "13:00",
                "end": "14:30",
                "title": "L&S 4 (L4-3) (大石)"
            },
            {
                "day": 1,
                "start": "14:40",
                "end": "16:10",
                "title": "L&S 4 (L1-2) (ロウレス)"
            },
            {
                "day": 4,
                "start": "13:00",
                "end": "14:30",
                "title": "Oral Comm 2 (渡丸) (渡丸)"
            },
            {
                "day": 5,
                "start": "13:00", "end": "14:30",
                "title": "R&W 4 (L2-3) (足立)"
            },
            {
                "day": 5,
                "start": "14:40",
                "end": "16:10",
                "title": "R&W 4 (L3-4) (足立)"
            }
        ]
    }
};